nova/DATA/DATA/row/fio_output_1G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 256MiB) test: (groupid=0, jobs=1): err= 0: pid=3221346: Mon Oct 14 20:04:46 2024 write: IOPS=150k, BW=584MiB/s (613MB/s)(256MiB/438msec); 0 zone resets clat (usec): min=4, max=1344, avg= 6.26, stdev= 7.36 lat (usec): min=4, max=1344, avg= 6.30, stdev= 7.36 clat percentiles (nsec): | 1.00th=[ 4768], 5.00th=[ 5024], 10.00th=[ 5152], 20.00th=[ 5280], | 30.00th=[ 5472], 40.00th=[ 5600], 50.00th=[ 5792], 60.00th=[ 6304], | 70.00th=[ 6752], 80.00th=[ 7008], 90.00th=[ 7392], 95.00th=[ 8096], | 99.00th=[ 9280], 99.50th=[11840], 99.90th=[22656], 99.95th=[23424], | 99.99th=[24960] lat (usec) : 10=99.37%, 20=0.41%, 50=0.22%, 100=0.01%, 750=0.01% lat (usec) : 1000=0.01% lat (msec) : 2=0.01% cpu : usr=8.92%, sys=89.93%, ctx=0, majf=0, minf=10 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=584MiB/s (613MB/s), 584MiB/s-584MiB/s (613MB/s-613MB/s), io=256MiB (268MB), run=438-438msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%