nova/DATA/DATA/row/fio_output_2G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 512MiB) test: (groupid=0, jobs=1): err= 0: pid=3222178: Mon Oct 14 20:04:50 2024 write: IOPS=151k, BW=589MiB/s (618MB/s)(512MiB/869msec); 0 zone resets clat (usec): min=4, max=2429, avg= 6.26, stdev=11.32 lat (usec): min=4, max=2429, avg= 6.31, stdev=11.32 clat percentiles (nsec): | 1.00th=[ 4832], 5.00th=[ 5024], 10.00th=[ 5152], 20.00th=[ 5344], | 30.00th=[ 5472], 40.00th=[ 5600], 50.00th=[ 5792], 60.00th=[ 6176], | 70.00th=[ 6752], 80.00th=[ 6944], 90.00th=[ 7392], 95.00th=[ 8096], | 99.00th=[ 9152], 99.50th=[10048], 99.90th=[21888], 99.95th=[23168], | 99.99th=[26496] bw ( KiB/s): min=607976, max=607976, per=100.00%, avg=607976.00, stdev= 0.00, samples=1 iops : min=151994, max=151994, avg=151994.00, stdev= 0.00, samples=1 lat (usec) : 10=99.48%, 20=0.34%, 50=0.17%, 100=0.01% lat (msec) : 2=0.01%, 4=0.01% cpu : usr=8.64%, sys=91.13%, ctx=1, majf=0, minf=11 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,131072,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=589MiB/s (618MB/s), 589MiB/s-589MiB/s (618MB/s-618MB/s), io=512MiB (537MB), run=869-869msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%