nova/DATA/DATA/row/fio_output_32G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 8192MiB) test: (groupid=0, jobs=1): err= 0: pid=3230523: Mon Oct 14 20:05:47 2024 write: IOPS=122k, BW=475MiB/s (498MB/s)(8192MiB/17232msec); 0 zone resets clat (usec): min=4, max=26411, avg= 7.84, stdev=164.45 lat (usec): min=4, max=26411, avg= 7.89, stdev=164.45 clat percentiles (nsec): | 1.00th=[ 5024], 5.00th=[ 5280], 10.00th=[ 5472], 20.00th=[ 5664], | 30.00th=[ 5792], 40.00th=[ 5984], 50.00th=[ 6176], 60.00th=[ 6560], | 70.00th=[ 7008], 80.00th=[ 7392], 90.00th=[ 7904], 95.00th=[ 8512], | 99.00th=[ 9792], 99.50th=[11712], 99.90th=[22912], 99.95th=[23936], | 99.99th=[26240] bw ( KiB/s): min=447816, max=527575, per=99.94%, avg=486516.53, stdev=20070.96, samples=34 iops : min=111954, max=131893, avg=121629.15, stdev=5017.69, samples=34 lat (usec) : 10=99.12%, 20=0.65%, 50=0.22%, 100=0.01% lat (msec) : 20=0.01%, 50=0.01% cpu : usr=4.45%, sys=95.52%, ctx=15, majf=0, minf=12 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,2097152,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=475MiB/s (498MB/s), 475MiB/s-475MiB/s (498MB/s-498MB/s), io=8192MiB (8590MB), run=17232-17232msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%