nova/DATA/DATA/row/fio_output_64G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 16384MiB) test: (groupid=0, jobs=1): err= 0: pid=3232958: Mon Oct 14 20:06:49 2024 write: IOPS=102k, BW=399MiB/s (419MB/s)(16.0GiB/41043msec); 0 zone resets clat (usec): min=4, max=51813, avg= 9.37, stdev=327.45 lat (usec): min=4, max=51813, avg= 9.41, stdev=327.45 clat percentiles (nsec): | 1.00th=[ 5152], 5.00th=[ 5472], 10.00th=[ 5600], 20.00th=[ 5856], | 30.00th=[ 6048], 40.00th=[ 6240], 50.00th=[ 6560], 60.00th=[ 7008], | 70.00th=[ 7328], 80.00th=[ 7648], 90.00th=[ 8160], 95.00th=[ 8768], | 99.00th=[ 9920], 99.50th=[14912], 99.90th=[23168], 99.95th=[23936], | 99.99th=[27008] bw ( KiB/s): min=362688, max=480024, per=100.00%, avg=409096.96, stdev=27064.20, samples=82 iops : min=90672, max=120006, avg=102274.15, stdev=6766.05, samples=82 lat (usec) : 10=99.01%, 20=0.73%, 50=0.24%, 100=0.01% lat (msec) : 50=0.01%, 100=0.01% cpu : usr=4.54%, sys=95.42%, ctx=38, majf=0, minf=11 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,4194304,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=399MiB/s (419MB/s), 399MiB/s-399MiB/s (419MB/s-419MB/s), io=16.0GiB (17.2GB), run=41043-41043msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%