nova/DATA/DATA/row/fio_output_8G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 2048MiB) test: (groupid=0, jobs=1): err= 0: pid=3225092: Mon Oct 14 20:05:04 2024 write: IOPS=138k, BW=538MiB/s (565MB/s)(2048MiB/3804msec); 0 zone resets clat (usec): min=4, max=6992, avg= 6.87, stdev=40.26 lat (usec): min=4, max=6992, avg= 6.92, stdev=40.26 clat percentiles (nsec): | 1.00th=[ 5024], 5.00th=[ 5216], 10.00th=[ 5344], 20.00th=[ 5536], | 30.00th=[ 5728], 40.00th=[ 5920], 50.00th=[ 6240], 60.00th=[ 6752], | 70.00th=[ 7008], 80.00th=[ 7328], 90.00th=[ 7968], 95.00th=[ 8512], | 99.00th=[ 9792], 99.50th=[12096], 99.90th=[22912], 99.95th=[23680], | 99.99th=[26496] bw ( KiB/s): min=535280, max=565840, per=100.00%, avg=552896.00, stdev=10040.50, samples=7 iops : min=133822, max=141460, avg=138224.29, stdev=2509.54, samples=7 lat (usec) : 10=99.16%, 20=0.60%, 50=0.24%, 100=0.01% lat (msec) : 4=0.01%, 10=0.01% cpu : usr=5.13%, sys=94.79%, ctx=5, majf=0, minf=11 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,524288,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=538MiB/s (565MB/s), 538MiB/s-538MiB/s (565MB/s-565MB/s), io=2048MiB (2147MB), run=3804-3804msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%